Use [Merh Univer]
drop table student1

create table student1
(
	[Номер зачетки] int primary key identity(1,1),
	ФИО nvarchar(50) not null,
	[Дата рождения] date not null,
	[Пол (м/ж)] nvarchar(1) not null check([Пол (м/ж)] in ('м','ж')),
	[Дата поступления] date not null

)

insert into student1 (ФИО, [Дата рождения], [Пол (м/ж)], [Дата поступления])
		Values	('Иванова Мария Викторовна', '2000-07-15', 'ж', '2021-07-15'),
				('Антонова Елизавета Максимовна', '2010-07-15', 'ж', '2021-07-15'),
				('Булочкин Андрей Олегович', '2003-07-14', 'м', '2021-07-15'),
				('Супова Раиса Александровна', '2003-07-14', 'ж', '2021-07-15')

SELECT 	* FROM student1
	Where [Пол (м/ж)] = 'ж' And DATEDIFF(year, [Дата рождения], [Дата поступления])>18
		or ([Пол (м/ж)] = 'ж' And DATEDIFF(year, [Дата рождения], [Дата поступления])=18 and DATEDIFF(month, [Дата рождения], [Дата поступления])>0)
		or ([Пол (м/ж)] = 'ж' And DATEDIFF(year, [Дата рождения], [Дата поступления])=18 and DATEDIFF(month, [Дата рождения], [Дата поступления])=0 and DATEDIFF(day, [Дата рождения], [Дата поступления])>=0)
